# 1. 정수형끼리의 연산은 
# 정수형으로 출력

# 덧셈
print(1 + 2)

# 뺄셈
print(2 - 2)

# 곱셈
print(3 * 2)

# 나머지
print(4 % 2)

# 거듭제곱
print(5 ** 2)

# 2.소수형끼리의 연산은
# 소수형으로 출력

# 덧셈
print(1.0 + 2.0)

# 뺄셈
print(2.0 - 2.0)

# 곱셈
print(3.0 * 2.0)

# 나머지
print(4.0 % 2.0)

# 거듭제곱
print(5.0 ** 2.0)

# 3.정수형과 소수형의 연산은
# 소수형으로 출력

# 덧셈
print(1 + 2.0)

# 뺄셈
print(2 - 2.0)

# 곱셈
print(3 * 2.0)

# 나머지
print(4 % 2.0)

# 거듭제곱
print(5 ** 2.0)

# 4.나눗셈은 정수형 소수형 상관없이
# 모두 소수형으로 출력

print(3/2)

print(3.0/2.0)

# 5. 사칙연산 순서를 따른다
# 곱셈하고 나서 덧셈
print(3+2*2)
# 우선순위를 괄호로 정해준다
print((3+2)*2)
